---
kind: type
id: T:Autodesk.Revit.DB.SketchBase
source: html/11df9ef5-c21a-8e70-f3d8-f6d131b36221.htm
---
# Autodesk.Revit.DB.SketchBase

Provides access to the SketchBase in Autodesk Revit.

## Syntax (C#)
```csharp
public class SketchBase : Element
```

## Remarks
SketchBase is the base class of Sketch.